app/controllers/posts_controller.rb

  def edit
    # show edit form for item with :id
		@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def update
    # update item with :id
	  @post = Post.find(params[:id])
	  @post.update(title: params[:title], description: params[:description])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["updated_at", "2015-12-31 20:39:10.987245"], ["id", 1]]